'''

    2 blank tiles (scoring 0 points)
    1 point: Α ×12, Ο ×9, Ε ×8, Ι ×8, Τ ×8, Η ×7, Σ ×7, Ν ×6
    2 points: Ρ ×5, Κ ×4, Π ×4, Υ ×4
    3 points: Λ ×3, Μ ×3, Ω ×3
    4 points: Γ ×2, Δ ×2
    8 points: Β ×1, Φ ×1, Χ ×1
    10 points: Ζ ×1, Θ ×1, Ξ ×1, Ψ ×1

https://en.wikipedia.org/wiki/Scrabble_letter_distributions#Greek

'''

maxAvailableLetters = 7



allLetters = (
    ["Α"] * 12  +
    ["Β"] * 1   +
    ["Γ"] * 2   +
    ["Δ"] * 2   +
    ["Ε"] * 8   +
    ["Ζ"] * 1   +
    ["Η"] * 7   +
    ["Θ"] * 1   +
    ["Ι"] * 8   +
    ["Κ"] * 4   +
    ["Λ"] * 3   +
    ["Μ"] * 3   +
    ["Ν"] * 6   +
    ["Ξ"] * 1   +
    ["Ο"] * 9   +
    ["Π"] * 4   +
    ["Ρ"] * 5   +
    ["Σ"] * 7   +
    ["Τ"] * 8   +
    ["Υ"] * 4   +
    ["Φ"] * 1   +
    ["Χ"] * 1   +
    ["Ψ"] * 1   +
    ["Ω"] * 3   +
    ["*"] * 2
)


lettersValues = {
    "Α" : 1 ,
    "Β" : 8 ,
    "Γ" : 4 ,
    "Δ" : 4 ,
    "Ε" : 1 ,
    "Ζ" : 10 ,
    "Η" : 1 ,
    "Θ" : 10 ,
    "Ι" : 1 ,
    "Κ" : 2 ,
    "Λ" : 3 ,
    "Μ" : 3 ,
    "Ν" : 1 ,
    "Ξ" : 10 ,
    "Ο" : 1 ,
    "Π" : 2 ,
    "Ρ" : 2 ,
    "Σ" : 1 ,
    "Τ" : 1 ,
    "Υ" : 2 ,
    "Φ" : 8 ,
    "Χ" : 8 ,
    "Ψ" : 10 ,
    "Ω" : 3 ,
    "*" : 0 ,
}


lettersInHand = []
lettersPlayed = []



########################################################################################################
########################################################################################################

if __name__ == "__main__":
    print("letter.py is being run directly")

    print(allLetters)#debugging
else:
    print("letter.py is being imported into another module")